app/helpers/sessions_helper.rb

  def current_user
    # cookieにuser_idが保存されていれば、ユーザー情報を取得する
    if session[:user_id]
      @current_user ||= User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]