app/controllers/sessions_controller.rb

  def create
    # 入力として受け取ったemailからユーザーを取り出す.
    user = User.find_by(email: params[:session][:email].downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "tarou@yahoo.com"], ["LIMIT", 1]]