app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all.order(created_at: :desc)
---
SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."created_at" DESC

  def create
    @task = Task.new(task_params)
    if @task.save
---
INSERT INTO "tasks" ("category", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["category", "japanese"], ["content", "japanese"], ["created_at", "2021-08-31 10:25:00.339065"], ["updated_at", "2021-08-31 10:25:00.339065"], ["user_id", 1]]

  def update
    @task = Task.find_by(id:params[:id])
    if @task.update(task_params)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
UPDATE "tasks" SET "category" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["category", "仕事(1)"], ["updated_at", "2021-08-31 11:47:36.859256"], ["id", 20]]

  def destroy
    Task.find_by(id:params[:id]).destroy
---
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 5]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]