app/controllers/users_controller.rb

  def index
    # usersテーブルにアクセスすると同時に、関連するテーブルを取得する。
    @users = User.includes(:task)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" IN (?, ?)  [["user_id", 1], ["user_id", 2]]
SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC

  def update
    @user = User.find_by(id:params[:id])
    if @user.update(name: user_params[:name], email: user_params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "太郎"], ["updated_at", "2021-09-02 13:18:42.164919"], ["id", 9]]